# Используем официальный образ Python
FROM python:3.11-slim

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем файл с зависимостями в контейнер
COPY requirements.txt .

# Устанавливаем зависимости
# --no-cache-dir чтобы не хранить кэш pip и уменьшить размер образа
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все остальные файлы проекта в рабочую директорию
COPY . .

# Сообщаем Docker, что наше приложение будет слушать порт 7860
EXPOSE 7860

# Команда для запуска Gunicorn. 
# Hugging Face Spaces ожидает, что приложение будет работать на порту 7860.
CMD ["gunicorn", "app:app", "--bind", "0.0.0.0:7860"]
